; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v4 - type_2 ?v3 - type_3)
 	      (pred_1 ?v7 - object ?v3 - type_3)
	      (pred_3 ?v4 - type_2 ?v1 - type_1)
	      (pred_4 ?v4 - type_2 ?v7 - object ?v1 - type_1))

   (:action op_2
       :parameters  (?v4 - type_2 ?v6 ?v5 - type_3)
       :precondition (and  (pred_2 ?v4 ?v6))
       :effect (and  (pred_2 ?v4 ?v5)
		     (not (pred_2 ?v4 ?v6))))

   (:action op_3
       :parameters (?v4 - type_2 ?v2 - object ?v8 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_1 ?v2 ?v8) (pred_2 ?v4 ?v8) (pred_3 ?v4 ?v1))
       :effect (and (pred_4 ?v4 ?v2 ?v1)
		    (not (pred_1 ?v2 ?v8)) 
		    (not (pred_3 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_2 ?v2 - object ?v8 - type_3 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v2 ?v1) (pred_2 ?v4 ?v8))
       :effect (and (pred_1 ?v2 ?v8)
		    (pred_3 ?v4 ?v1)
		    (not (pred_4 ?v4 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_03 - type_2
obj_12 obj_13 obj_11 obj_07 - type_1
obj_01 obj_09 obj_08 obj_04 - type_3
obj_06 obj_02 obj_10 - object)
(:init
(pred_2 obj_05 obj_01)
(pred_3 obj_05 obj_12)
(pred_3 obj_05 obj_13)
(pred_2 obj_03 obj_09)
(pred_3 obj_03 obj_11)
(pred_3 obj_03 obj_07)
(pred_1 obj_06 obj_08)
(pred_1 obj_02 obj_08)
(pred_1 obj_10 obj_04)
)
(:goal
(and
(pred_1 obj_06 obj_09)
(pred_1 obj_02 obj_04)
(pred_1 obj_10 obj_01)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_05 obj_04) (pred_2 obj_03 obj_04))))
  )
)
)

; plan
1. (op_2 obj_05 obj_01 obj_08)
   deleted: (pred_2 obj_05 obj_01)
   added: (pred_2 obj_05 obj_08)
   goals met: 0 of 3
2. (op_2 obj_03 obj_09 obj_08)
   deleted: (pred_2 obj_03 obj_09)
   added: (pred_2 obj_03 obj_08)
   goals met: 0 of 3
3. (op_3 obj_05 obj_02 obj_08 obj_13)
   deleted: (pred_1 obj_02 obj_08) (pred_3 obj_05 obj_13)
   added: (pred_4 obj_05 obj_02 obj_13)
   goals met: 0 of 3
4. (op_3 obj_05 obj_06 obj_08 obj_12)
   deleted: (pred_1 obj_06 obj_08) (pred_3 obj_05 obj_12)
   added: (pred_4 obj_05 obj_06 obj_12)
   goals met: 0 of 3
5. (op_2 obj_03 obj_08 obj_04)
   deleted: (pred_2 obj_03 obj_08)
   added: (pred_2 obj_03 obj_04)
   goals met: 0 of 3
6. (op_2 obj_05 obj_08 obj_09)
   deleted: (pred_2 obj_05 obj_08)
   added: (pred_2 obj_05 obj_09)
   goals met: 0 of 3
7. (op_3 obj_03 obj_10 obj_04 obj_07)
   deleted: (pred_1 obj_10 obj_04) (pred_3 obj_03 obj_07)
   added: (pred_4 obj_03 obj_10 obj_07)
   goals met: 0 of 3
8. (op_2 obj_03 obj_04 obj_01)
   deleted: (pred_2 obj_03 obj_04)
   added: (pred_2 obj_03 obj_01)
   goals met: 0 of 3
9. (op_1 obj_05 obj_06 obj_09 obj_12)
   deleted: (pred_4 obj_05 obj_06 obj_12)
   added: (pred_1 obj_06 obj_09) (pred_3 obj_05 obj_12)
   goals met: 1 of 3
10. (op_2 obj_05 obj_09 obj_04)
   deleted: (pred_2 obj_05 obj_09)
   added: (pred_2 obj_05 obj_04)
   goals met: 1 of 3
11. (op_1 obj_03 obj_10 obj_01 obj_07)
   deleted: (pred_4 obj_03 obj_10 obj_07)
   added: (pred_1 obj_10 obj_01) (pred_3 obj_03 obj_07)
   goals met: 2 of 3
12. (op_1 obj_05 obj_02 obj_04 obj_13)
   deleted: (pred_4 obj_05 obj_02 obj_13)
   added: (pred_1 obj_02 obj_04) (pred_3 obj_05 obj_13)
   goals met: 3 of 3
